# St7SetSolverStressStiffening

Sets the state of the stress stiffening option for natural frequency and linear transient dynamic analyses with
initial conditions.

long St7SetSolverStressStiffening(long uID, bool AddStressStiffening)

Input Parameters

uID

Strand7 model file ID.

AddStressStiffening

True to include the stress stiffening effects.